# StructuralFloorAnalyzesAs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralFloorAnalyzesAs Property
ParameterTypeId Class See Also
---
"Analyze As"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralFloorAnalyzesAs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralFloorAnalyzesAs As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralFloorAnalyzesAs {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace